# FaceNode Methods

---
The FaceNode type exposes the following members.
| Name| Description
---|---|---
| Dispose| (Inherited from RenderNode)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetFace|  Returns the Face object corresponding to the node.
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
FaceNode Class
Autodesk.Revit.DB Namespace